---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FilteredElementCollector
zh: 筛选、过滤
source: html/163d1fae-e9d8-e4de-7452-c3b140b6daad.htm
---
# FilteredElementCollector Members

**中文**: 筛选、过滤

Constructs a new FilteredElementCollector that will search and filter the set of elements in a document.